{
  "work": [
    {
      "company": "AlertD",
      "role": "Développeur Full Stack",
      "startDate": "10/2025",
      "endDate": "12/2025",
      "location": "San Francisco, CA, États-Unis",
      "description": "Architecture de plateformes pilotées par l'IA à haute disponibilité conçues pour éliminer les tâches opérationnelles des équipes DevOps/SRE, assurant une évolutivité sans faille. Modernisation des stratégies UI/UX en étroite collaboration avec la conception de produits, mise en œuvre de systèmes de composants robustes qui favorisent la rétention des utilisateurs. Ingénierie de flux de travail résilients pour identifier et résoudre les anomalies critiques dans les processus d'IA.",
      "techStack": [
        "React",
        "TypeScript",
        "Bun",
        "AWS",
        "LangChain",
        "Tailwind CSS",
        "Shadcn/UI",
        "Claude Code"
      ]
    },
    {
      "company": "TOTVS",
      "role": "Développeur Full Stack Senior",
      "startDate": "11/2023",
      "endDate": "06/2025",
      "location": "São Paulo, SP, Brésil",
      "description": "A dirigé le développement complet d'outils internes stratégiques, traduisant directement des exigences commerciales complexes en solutions logicielles à haute efficacité. A conçu des outils personnalisés pour optimiser les flux de travail internes, réduisant la latence des processus et augmentant la productivité inter-équipes. A agi en tant que conseiller technique clé, définissant des normes architecturales pour l'évolutivité et la maintenabilité à long terme.",
      "techStack": [
        "Next.js",
        "Angular",
        "NestJS",
        "TypeScript",
        "PostgreSQL",
        "Docker",
        "AWS",
        "Agile",
        "CI/CD",
        "TDD",
        "Clean Architecture"
      ]
    },
    {
      "company": "WHIMworks Inc.",
      "role": "Développeur Full Stack",
      "startDate": "01/2022",
      "endDate": "05/2023",
      "location": "Montréal, QC, Canada",
      "description": "A conçu des expériences numériques immersives et performantes pour des clients mondiaux de premier rang, notamment Spotify, Sonos, Sony et Samsung. A dirigé la refonte de bases de code héritées en utilisant React et Svelte, réalisant des gains significatifs en termes de performances de l'interface utilisateur et de classement SEO. A développé des plateformes de vente interactives haute fidélité, intégrant des animations complexes et une gestion d'état fluide.",
      "techStack": [
        "React",
        "Svelte",
        "Tailwind CSS",
        "TypeScript",
        "SEO",
        "Motion",
        "Shopify"
      ]
    },
    {
      "company": "Impulso (Mosaico)",
      "role": "Développeur Full Stack",
      "startDate": "04/2021",
      "endDate": "12/2021",
      "location": "Rio de Janeiro, RJ, Brésil",
      "description": "A optimisé des modules SEO à fort trafic pour la plus grande plateforme de contenu et de vente du Brésil. A mis en œuvre une architecture sans serveur utilisant AWS Lambda, réduisant considérablement les frais d'infrastructure et les temps de réponse. A orchestré des pipelines CI/CD complets pour rationaliser le déploiement dans plusieurs environnements de test et de production.",
      "techStack": [
        "React",
        "Tailwind CSS",
        "AWS Lambda",
        "Serverless",
        "SEO",
        "Strapi",
        "TypeScript",
        "CI/CD"
      ]
    },
    {
      "company": "Codeby",
      "role": "Développeur Full Stack",
      "startDate": "01/2021",
      "endDate": "05/2021",
      "location": "São Paulo, SP, Brésil",
      "description": "A livré des solutions de commerce électronique complexes et multilingues (VTEX/Shopify) pour les marchés internationaux. A construit des intégrations sans serveur personnalisées en utilisant TypeScript et AWS pour étendre les capacités de la plateforme au-delà des limites natives.",
      "techStack": [
        "VTEX IO",
        "Shopify",
        "React",
        "Node.js",
        "AWS",
        "TypeScript"
      ]
    },
    {
      "company": "Bossabox",
      "role": "Tech Lead",
      "startDate": "12/2020",
      "endDate": "02/2021",
      "location": "São Paulo, SP, Brésil",
      "description": "A dirigé les phases de découverte technique et d'analyse comparative pour un nouvel outil interne stratégique, menant des études de faisabilité et des évaluations architecturales pour définir la fondation technologique du projet.",
      "techStack": [
        "Technical Discovery",
        "Benchmarking",
        "Architecture",
        "Strategy"
      ]
    },
    {
      "company": "Buzzmonitor",
      "role": "Tech Lead & Développeur Full Stack",
      "startDate": "06/2019",
      "endDate": "05/2021",
      "location": "Recife, PE, Brésil",
      "description": "Progression Rapide : Promu de Développeur Frontend à Tech Lead en 12 mois grâce à l'excellence technique. A dirigé une équipe de développement dans la construction d'un SaaS basé sur des microservices pour l'analyse de données sociales utilisant Elasticsearch pour des requêtes complexes. A géré l'infrastructure cloud sur AWS, assurant une disponibilité de 99,9 % pour une base d'utilisateurs croissante.",
      "techStack": [
        "Next.js",
        "React",
        "Tailwind CSS",
        "TypeScript",
        "Elasticsearch",
        "AWS",
        "Microservices",
        "Node.js"
      ]
    },
    {
      "company": "TJRN - Tribunal de Justiça do Rio Grande do Norte",
      "role": "Stagiaire Développeur Logiciel",
      "startDate": "08/2017",
      "endDate": "12/2018",
      "location": "Natal, RN, Brésil",
      "description": "A développé et maintenu des outils internes pour le système judiciaire, améliorant l'efficacité et l'accessibilité pour les juges et le personnel.",
      "techStack": [
        "Java",
        "React Native",
        "Angular",
        "Internal Tools",
        "SQL"
      ]
    },
    {
      "company": "TEAM - UFRN",
      "role": "Assistant de Recherche",
      "startDate": "02/2016",
      "endDate": "12/2018",
      "location": "Natal, RN, Brésil",
      "description": "A aidé à la création de projets innovants pour des étudiants en master professionnel. A enseigné les principes fondamentaux du développement web pour aider les étudiants à construire et déployer leurs applications basées sur la recherche.",
      "techStack": [
        "Web Development",
        "HTML/CSS",
        "JavaScript",
        "React",
        "Node.js"
      ]
    }
  ],
  "education": [
    {
      "institution": "Rocketseat",
      "degree": "Diplôme de Troisième Cycle - Tech Developer 360",
      "startDate": "2025",
      "endDate": "2026 (En Cours)",
      "location": "Brésil"
    },
    {
      "institution": "Universidade Federal do Rio Grande do Norte (UFRN)",
      "degree": "Licence en Génie Informatique",
      "startDate": "2015",
      "endDate": "2019",
      "location": "Brésil"
    }
  ]
}