{
  "work": [
    {
      "company": "AlertD",
      "role": "Desenvolvedor Full Stack",
      "startDate": "10/2025",
      "endDate": "12/2025",
      "location": "São Francisco, CA, EUA",
      "description": "Arquitetando plataformas de IA de alta disponibilidade, projetadas para eliminar carga operacional de equipes DevOps/SRE e garantir escalabilidade contínua. Modernizo estratégias de UI/UX em colaboração direta com design de produto, implementando design systems robustos que aumentam a retenção de usuários. Engenharia de fluxos resilientes para identificar e resolver anomalias críticas em processos de IA.",
      "techStack": [
        "React",
        "TypeScript",
        "Bun",
        "AWS",
        "LangChain",
        "Tailwind CSS",
        "Shadcn/UI",
        "Claude Code"
      ]
    },
    {
      "company": "TOTVS",
      "role": "Desenvolvedor Full Stack Sênior",
      "startDate": "11/2023",
      "endDate": "06/2025",
      "location": "São Paulo, SP, Brasil",
      "description": "Liderei o ciclo completo de desenvolvimento de ferramentas internas estratégicas, convertendo requisitos de negócios complexos em software de alta eficiência. Criei soluções personalizadas para otimizar fluxos de trabalho, reduzindo latência e aumentando a produtividade entre equipes. Atuei como consultor técnico chave, definindo padrões arquitetônicos para escalabilidade e manutenibilidade a longo prazo.",
      "techStack": [
        "Next.js",
        "Angular",
        "NestJS",
        "TypeScript",
        "PostgreSQL",
        "Docker",
        "AWS",
        "Agile",
        "CI/CD",
        "TDD",
        "Clean Architecture"
      ]
    },
    {
      "company": "WHIMworks Inc.",
      "role": "Desenvolvedor Full Stack",
      "startDate": "01/2022",
      "endDate": "05/2023",
      "location": "Montreal, QC, Canadá",
      "description": "Projetei experiências digitais imersivas de alta performance para clientes globais Tier 1, como Spotify, Sonos, Sony e Samsung. Liderei a refatoração de bases de código legadas utilizando React e Svelte, conquistando ganhos significativos em performance de UI e SEO. Desenvolvi plataformas de vendas interativas de alta fidelidade, integrando animações complexas e gerenciamento de estado fluido.",
      "techStack": [
        "React",
        "Svelte",
        "Tailwind CSS",
        "TypeScript",
        "SEO",
        "Motion",
        "Shopify"
      ]
    },
    {
      "company": "Impulso (Mosaico)",
      "role": "Desenvolvedor Full Stack",
      "startDate": "04/2021",
      "endDate": "12/2021",
      "location": "Rio de Janeiro, RJ, Brasil",
      "description": "Otimizei módulos de SEO de alto tráfego para a maior plataforma de conteúdo e vendas do Brasil. Implementei arquitetura serverless com AWS Lambda, reduzindo drasticamente custos de infraestrutura e tempos de resposta. Orquestrei pipelines de CI/CD abrangentes para agilizar o deploy em múltiplos ambientes.",
      "techStack": [
        "React",
        "Tailwind CSS",
        "AWS Lambda",
        "Serverless",
        "SEO",
        "Strapi",
        "TypeScript",
        "CI/CD"
      ]
    },
    {
      "company": "Codeby",
      "role": "Desenvolvedor Full Stack",
      "startDate": "01/2021",
      "endDate": "05/2021",
      "location": "São Paulo, SP, Brasil",
      "description": "Entreguei soluções de e-commerce complexas e multilíngues (VTEX/Shopify) para mercados internacionais. Construí integrações serverless personalizadas com TypeScript e AWS para estender as capacidades das plataformas além de seus limites nativos.",
      "techStack": [
        "VTEX IO",
        "Shopify",
        "React",
        "Node.js",
        "AWS",
        "TypeScript"
      ]
    },
    {
      "company": "Bossabox",
      "role": "Tech Lead",
      "startDate": "12/2020",
      "endDate": "02/2021",
      "location": "São Paulo, SP, Brasil",
      "description": "Liderei as fases de descoberta técnica e benchmarking para uma nova ferramenta interna estratégica, conduzindo estudos de viabilidade e avaliações arquitetônicas para definir as fundações tecnológicas do projeto.",
      "techStack": [
        "Technical Discovery",
        "Benchmarking",
        "Architecture",
        "Strategy"
      ]
    },
    {
      "company": "Buzzmonitor",
      "role": "Tech Lead & Desenvolvedor Full Stack",
      "startDate": "06/2019",
      "endDate": "05/2021",
      "location": "Recife, PE, Brasil",
      "description": "Evolução Rápida: Promovido de Desenvolvedor Frontend a Líder Técnico em 12 meses pela excelência técnica. Dirigi uma equipe de desenvolvimento na construção de um SaaS baseado em microsserviços para análise de dados sociais, utilizando Elasticsearch para consultas complexas. Gerenciei a infraestrutura em nuvem na AWS, garantindo 99,9% de disponibilidade para uma base de usuários em crescimento.",
      "techStack": [
        "Next.js",
        "React",
        "Tailwind CSS",
        "TypeScript",
        "Elasticsearch",
        "AWS",
        "Microservices",
        "Node.js"
      ]
    },
    {
      "company": "TJRN - Tribunal de Justiça do Rio Grande do Norte",
      "role": "Estagiário de Desenvolvimento de Software",
      "startDate": "08/2017",
      "endDate": "12/2018",
      "location": "Natal, RN, Brasil",
      "description": "Desenvolvi e mantive ferramentas internas para o sistema judiciário, melhorando a eficiência e acessibilidade para juízes e servidores.",
      "techStack": [
        "Java",
        "React Native",
        "Angular",
        "Internal Tools",
        "SQL"
      ]
    },
    {
      "company": "TEAM - UFRN",
      "role": "Assistente de Pesquisa",
      "startDate": "02/2016",
      "endDate": "12/2018",
      "location": "Natal, RN, Brasil",
      "description": "Auxiliei na criação de projetos inovadores para alunos de mestrado profissional. Ensinei fundamentos de desenvolvimento web para capacitar alunos a construir e implantar suas aplicações de pesquisa.",
      "techStack": [
        "Web Development",
        "HTML/CSS",
        "JavaScript",
        "React",
        "Node.js"
      ]
    }
  ],
  "education": [
    {
      "institution": "Rocketseat",
      "degree": "Pós-graduação - Tech Developer 360",
      "startDate": "2025",
      "endDate": "2026 (Em Andamento)",
      "location": "Brasil"
    },
    {
      "institution": "Universidade Federal do Rio Grande do Norte (UFRN)",
      "degree": "Bacharelado em Engenharia da Computação",
      "startDate": "2015",
      "endDate": "2019",
      "location": "Brasil"
    }
  ]
}