[
  {
    "title": "O Elemento Humano",
    "icon": "Heart",
    "content": "Sempre acreditei que a tecnologia é, em sua essência, sobre pessoas. Minha jornada não começou com um fascínio por algoritmos, mas com o desejo de ajudar. Desde ensinar novatos até construir ferramentas para o serviço público, o objetivo nunca foi apenas a stack tecnológica — era sobre ser útil. Escrevo código para resolver problemas humanos. Percebi cedo que o melhor código não é apenas sobre o software em si; é sobre as barreiras que ele remove e as vidas que facilita."
  },
  {
    "title": "Mantendo o Equilíbrio",
    "icon": "Snowflake",
    "content": "Ambientes acelerados ficam barulhentos. Aprendi que a melhor maneira de lidar com a pressão não é acelerar, mas desacelerar. Trazendo do meu treino em artes marciais, mantenho os pés no chão quando outros entram em pânico. Não se trata de combater fogo com mais fogo; trata-se de manter a cabeça fria para encontrar a saída mais inteligente."
  },
  {
    "title": "A Mecânica do Porquê",
    "icon": "Puzzle",
    "content": "Tenho uma curiosidade incansável sobre como as coisas funcionam. Mover-me para a arena global me deu a chance de enfrentar quebra-cabeças em escala massiva — otimizar desempenho para milhões de usuários ou arquitetar sistemas à prova de balas. Mas para mim, a emoção não está apenas na vitória técnica; está no artesanato. É a satisfação de pegar um problema complexo e bagunçado e refiná-lo até que funcione perfeitamente."
  },
  {
    "title": "Fundações Primeiro",
    "icon": "Castle",
    "content": "Ultimamente, meu foco gravitou naturalmente para o lado estrutural do software — arquitetar sistemas que não são apenas funcionais, mas duradouros. Não se trata apenas de entregar uma funcionalidade; é garantir que o sistema aguente as próximas cem. Quero construir uma arquitetura que dure, criando um espaço onde a equipe se mova rápido sem quebrar as coisas. Trata-se de deixar a base de código melhor do que a encontrei, todas as vezes."
  }
]